app/Http/Controllers/HorseController.php

select * from `horses`
---
    public function index()
    {

        $horses = Horse::paginate(6);

select * from `caretakers`
---
    public function create()
    {
        $caretakers = Caretaker::all();

insert into `horses` (`name`, `breed`, `color`, `birth_date`, `gender`, `father_name`, `mother_name`, `caretaker_id`, `number_microchip`, `updated_at`, `created_at`) values ('Papurri', 'tobiano', 'vadsvavadv', '2025-07-24', 'female', 'vivoras', 'afafafa', '3', '1726485BBGJF', '2025-07-26 10:49:26', '2025-07-26 10:49:26')
insert into `horse_photos` (`path`, `horse_id`, `updated_at`, `created_at`) values ('horses/3f0e0MMRZNkRVx8vxYY5Yl4YP8wDRdslbw3h37Kk.png', 16, '2025-07-26 10:49:26', '2025-07-26 10:49:26')
---
    public function store(StoreHorseRequest $request)

    {
   $data = $request->validated();

    if ($request->hasFile('photo')) {
        $data['photo_path'] = $request->file('photo')->store('horses', 'public');
    }

    $horse = Horse::create($data);

    if ($request->hasFile('photos')) {
        foreach ($request->file('photos') as $image) {
            $path = $image->store('horses', 'public');
            $horse->photos()->create(['path' => $path]);

select * from `caretakers`
---
    public function edit(Horse $horse)
{
       $caretakers = Caretaker::all();