app/Http/Controllers/VetVisitController.php

select * from `horses` where `horses`.`id` in (2)
select * from `vet_visits` order by `created_at` desc
---
    public function index()
    {
        $visits = VetVisit::with('horse')->latest()->get();

select * from `horses`
---
    public function create()
    {
        $horses = Horse::all(); // Para el select de caballos

insert into `vet_visits` (`horse_id`, `visit_date`, `vet_name`, `vet_phone`, `diagnosis`, `treatment`, `next_visit`, `updated_at`, `created_at`) values ('15', '2025-08-22', 'Emiliano', '123456789', 'le duele la pancha', 'descanso y suplementar certal cada 2 horas', '2025-08-30', '2025-08-06 01:46:49', '2025-08-06 01:46:49')
---
    public function store(StoreVetVisitRequest $request)
    {
        VetVisit::create($request->validated());

select * from `horses`
---
    public function edit(VetVisit $vetVisit)
    {
        $horses = Horse::all();

update `vet_visits` set `diagnosis` = 'fractura del metatarsiano y rotura de pezuña', `vet_visits`.`updated_at` = '2025-08-06 01:43:10' where `id` = 1
---
    public function update(UpdateVetVisitRequest $request, VetVisit $vetVisit)
    {
        $vetVisit->update($request->validated());

delete from `vet_visits` where `id` = 1
---
    public function destroy(VetVisit $vetVisit)
    {
        $vetVisit->delete();